Tekla.Structures.Model.SpiralBeam.ErrorStatus
Define possible statuses for geometry creation/modification commands.

Tekla.Structures.Model.SpiralBeam.ErrorStatus.DataMissing
Status when some part data is missing.

Tekla.Structures.Model.SpiralBeam.ErrorStatus.DefinitionPointsTooClose
Status when definition points are too close.

Tekla.Structures.Model.SpiralBeam.ErrorStatus.DefinitionPointsCannotBeAligned
Status when definition points are on line with sweep direction.

Tekla.Structures.Model.SpiralBeam.ErrorStatus.ZeroTotalRiseWithMore360Degrees
Status when total rise is zero and rotation angle more than 360 degrees.

Tekla.Structures.Model.SpiralBeam.ErrorStatus.RotationAngleIs0Degrees
Status when rotation angle is 0 degrees.

Tekla.Structures.Model.SpiralBeam.ErrorStatus.InvalidGeometry
Status when helix has invalid geometry.